let file_permissions = dynamic(['File.Read', 'Files.Read.All', 'Files.ReadWrite', 'Files.ReadWrite.All', 'Files.ReadWrite.AppFolder']);
AuditLogs
| where Category =~ 'ApplicationManagement'
| where OperationName has 'Consent to application'
| where Result =~ 'success'
| extend ModifiedProperties = TargetResources[0].modifiedProperties
| mv-apply Property = ModifiedProperties on
    (
        where.Property.displayName =~ 'ConsentContext.IsAdminConsent'
        | extend IsAdminConsent = Property.newValue
    )
| mv-apply Property = ModifiedProperties on
    (
        where.Property.displayName =~ 'ConsentAction.Permissions'
        | extend AppPermissions = Property.newValue
    )
| where IsAdminConsent has 'Failure'
| where AppPermissions has_any (file_permissions)
